DataProcessors/ТелеграмИИТрансляцияКамеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ТелеграмИИТрансляцияКамеры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ТелеграмОбработкаСообщенийИИАктивные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмОбработкаСообщенийИИАктивные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасположениеПроцедуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеПроцедуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеДанныеОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеДанныеОборудования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Настройки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаНастроек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТелеграмИИТрансляцияКамеры/Ext/ObjectModule.bsl
Процедура ПроцедураДляВызова(СсылкаДокВхСообщение) Экспорт

	ПозицияАдресаБота = СтрНайти(СсылкаДокВхСообщение.Текст, Справочники.ТелеграмПараметры.АдресБота.Значение);
	Если ПозицияАдресаБота > 0 Тогда
		ТекстСообщения = Лев(СсылкаДокВхСообщение.Текст, ПозицияАдресаБота-1);
	Иначе
		ТекстСообщения = СсылкаДокВхСообщение.Текст;
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.ТелеграмОбработкаСообщенийИИАктивные.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТелеграмКонтакт = СсылкаДокВхСообщение.ТелеграмКонтакт;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.РасположениеПроцедуры <> "Обработки.ТелеграмИИТрансляцияКамеры" или МенеджерЗаписи.НазваниеПроцедуры <> "ПроцедураДляВызова"  Тогда
		//Это первая итерация
		МенеджерЗаписи.ТелеграмКонтакт = СсылкаДокВхСообщение.ТелеграмКонтакт;
		МенеджерЗаписи.РасположениеПроцедуры = "Обработки.ТелеграмИИТрансляцияКамеры";
		МенеджерЗаписи.НазваниеПроцедуры = "ПроцедураДляВызова";
		ТекущиеДанные = Новый Структура();
		ТекущиеДанные.Вставить("КолВыполненныхИтераций", 1);
		ТекущиеДанные.Вставить("ОжидаемыйТипОтветаПользователя", "НомерВыбраннойКамеры");
		ТекущиеДанные.Вставить("Камера", Неопределено);
		ТекущиеДанные.Вставить("Транслировать", Ложь);
		мКамеры = Новый Массив();
		
		Текст = "Выберите камеру:";
		
		н = 0;
		Для Каждого КарточкаКамеры Из Справочники.Настройки.СписокКамер.ТаблицаНастроек Цикл
			н = н + 1;
			ОборудованиеКамера = КарточкаКамеры.Значение;	
			мКамеры.Добавить(ОборудованиеКамера);
			Текст = Текст + Символы.ПС + "/" + Формат(н,"ЧГ=") + " " + ОборудованиеКамера.Наименование; 
		КонецЦикла;
		
		ТекущиеДанные.Вставить("мКамеры", мКамеры);
		
		МенеджерЗаписи.ТекущиеДанные = Новый ХранилищеЗначения(ТекущиеДанные);
		МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
		МенеджерЗаписи.Записать(Истина);		
		
		Сообщение = Новый Структура();
		Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
		Сообщение.Вставить("Текст", Текст);
		ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
		
	Иначе
		ТекущиеДанные = МенеджерЗаписи.ТекущиеДанные.Получить();
		ТекущиеДанные.КолВыполненныхИтераций = ТекущиеДанные.КолВыполненныхИтераций + 1;

		Если ТекущиеДанные.ОжидаемыйТипОтветаПользователя = "НомерВыбраннойКамеры" Тогда
			ТекРазмерФайла = 0;
			Пока ТекРазмерФайла < 100 Цикл  // Если изображение меньше 100 байт тогда считаем что файл пустой
				КамераОборудование = ТекущиеДанные.мКамеры.Получить(Число(Сред(ТекстСообщения, 2)) - 1);
				УправлениеОборудованием.ПолучитьФотоСКамерыИПоместитьЕгоВРегистрТекущиеДанныеОборудования(КамераОборудование);
				ЗаписьРегистра = РегистрыСведений.ТекущиеДанныеОборудования.Получить(Новый Структура("Оборудование, ОбъектДанных", КамераОборудование, "Трансляция"));
				ДвоичныйДанныеФотографии = ЗаписьРегистра.Хранилище.Получить();
				ФотоСКамеры = Новый Картинка(ДвоичныйДанныеФотографии);
				ПолныйПутьКФайлуСФото = ПолучитьИмяВременногоФайла("jpg");
				ФотоСКамеры.Записать(ПолныйПутьКФайлуСФото);
				ТекРазмерФайла = ФотоСКамеры.РазмерФайла();
			КонецЦикла;								
								
			ТекущиеДанные.Вставить("ДатаПоследнегоОтправленногоСнимка", ЗаписьРегистра.Дата);
			ТекущиеДанные.Вставить("ОжидаемыйТипОтветаПользователя", "НомерВыбраннойКамеры");
			ТекущиеДанные.Вставить("Камера", КамераОборудование);
			ТекущиеДанные.Вставить("Транслировать", Истина);
			
			Сообщение = Новый Структура();
			Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
			Сообщение.Вставить("ФайлПуть", ПолныйПутьКФайлуСФото);
			Сообщение.Вставить("ФайлТип", "photo");
			СсылкаНаДокСообщениеИсх = ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
			
			ТекущиеДанные.Вставить("ИсхСообщениеТрансляции", СсылкаНаДокСообщениеИсх);
			
			МенеджерЗаписи.ТекущиеДанные = Новый ХранилищеЗначения(ТекущиеДанные);
			МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
			МенеджерЗаписи.Записать(Истина);
			
			мПараметры = Новый Массив();
			мПараметры.Добавить(СсылкаДокВхСообщение.ТелеграмКонтакт);
			ОбщегоНазначения.ВыполнитьПроцедуруФункциюВФонеНаСервере("Обработки.ТелеграмИИТрансляцияКамеры.ФоновыйПроцессТрансляцииКамеры", мПараметры);
		КонецЕсли;
	
		
	КонецЕсли;

	
КонецПроцедуры


//Продолжение в модуле менеджера
